batmankilltheJoker/STM32WLE5CUB6/LoRaWAN_End_Node_SHT30/LoRaWAN/App/lora_app.c
static Adafruit_SHT31 g_sht31;                 // SHT31 ????
volatile float g_sht31_temp_c = 0;           // ??????(�C)
volatile float g_sht31_hum_rh = 0;           // ??????(%RH)

/**
 * @brief User application buffer
 */
static uint8_t AppDataBuffer[LORAWAN_APP_DATA_BUFFER_MAX_SIZE];

/**
 * @brief User application data structure
 */
static LmHandlerAppData_t AppData = {0, 0, AppDataBuffer};

/**
 * @brief Specifies the state of the application LED
 */
static uint8_t AppLedStateOn = RESET;

/**
 * @brief Timer to handle the application Tx Led to toggle
 */
static UTIL_TIMER_Object_t TxLedTimer;

/**
 * @brief Timer to handle the application Rx Led to toggle
 */
static UTIL_TIMER_Object_t RxLedTimer;

/**
 * @brief Timer to handle the application Join Led to toggle
 */
static UTIL_TIMER_Object_t JoinLedTimer;

/* USER CODE END PV */

/* Exported functions ---------------------------------------------------------*/
/* USER CODE BEGIN EF */

/* USER CODE END EF */

void LoRaWAN_Init(void)
{
  /* USER CODE BEGIN LoRaWAN_Init_LV */
  uint32_t feature_version = 0UL;
  /* USER CODE END LoRaWAN_Init_LV */

  /* USER CODE BEGIN LoRaWAN_Init_1 */

  /* Get LoRaWAN APP version*/
  APP_LOG(TS_OFF, VLEVEL_M, "APPLICATION_VERSION: V%X.%X.%X\r\n",
          (uint8_t)(APP_VERSION_MAIN),
          (uint8_t)(APP_VERSION_SUB1),
          (uint8_t)(APP_VERSION_SUB2));

  /* Get MW LoRaWAN info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_LORAWAN_VERSION:  V%X.%X.%X\r\n",
          (uint8_t)(LORAWAN_VERSION_MAIN),
          (uint8_t)(LORAWAN_VERSION_SUB1),
          (uint8_t)(LORAWAN_VERSION_SUB2));

  /* Get MW SubGhz_Phy info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_RADIO_VERSION:    V%X.%X.%X\r\n",
          (uint8_t)(SUBGHZ_PHY_VERSION_MAIN),
          (uint8_t)(SUBGHZ_PHY_VERSION_SUB1),
          (uint8_t)(SUBGHZ_PHY_VERSION_SUB2));

  /* Get LoRaWAN Link Layer info */
  LmHandlerGetVersion(LORAMAC_HANDLER_L2_VERSION, &feature_version);
  APP_LOG(TS_OFF, VLEVEL_M, "L2_SPEC_VERSION:     V%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8));

  /* Get LoRaWAN Regional Parameters info */
  LmHandlerGetVersion(LORAMAC_HANDLER_REGION_VERSION, &feature_version);
  APP_LOG(TS_OFF, VLEVEL_M, "RP_SPEC_VERSION:     V%X-%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8),
          (uint8_t)(feature_version));

  UTIL_TIMER_Create(&TxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnTxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&RxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&JoinLedTimer, LED_PERIOD_TIME, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);

  /* USER CODE END LoRaWAN_Init_1 */

  UTIL_TIMER_Create(&StopJoinTimer, JOIN_TIME, UTIL_TIMER_ONESHOT, OnStopJoinTimerEvent, NULL);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU, LmHandlerProcess);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), UTIL_SEQ_RFU, SendTxData);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStoreContextEvent), UTIL_SEQ_RFU, StoreContext);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent), UTIL_SEQ_RFU, StopJoin);

  /* Init Info table used by LmHandler*/
  LoraInfo_Init();

  /* Init the Lora Stack*/
  LmHandlerInit(&LmHandlerCallbacks, APP_VERSION);

  LmHandlerConfigure(&LmHandlerParams);

  /* USER CODE BEGIN LoRaWAN_Init_2 */
  UTIL_TIMER_Start(&JoinLedTimer);

  /* USER CODE END LoRaWAN_Init_2 */

  LmHandlerJoin(ActivationType, ForceRejoin);

  if (EventType == TX_ON_TIMER)
  {
    /* send every time timer elapses */
    UTIL_TIMER_Create(&TxTimer, APP_PERIODIC_TX_INTERVAL_MS, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
    UTIL_TIMER_Start(&TxTimer);
  }
  else
  {
    /* USER CODE BEGIN LoRaWAN_Init_3 */

    /* USER CODE END LoRaWAN_Init_3 */
  }

  /* USER CODE BEGIN LoRaWAN_Init_Last */

  /* USER CODE END LoRaWAN_Init_Last */
}

/* USER CODE BEGIN PB_Callbacks */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  //  switch (GPIO_Pin)
  //  {
  //    case  BUT1_Pin:
  //      /* Note: when "EventType == TX_ON_TIMER" this GPIO is not initialized */
  //      if (EventType == TX_ON_EVENT)
  //      {
  //        UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
  //      }
  //      break;

  //    default:
  //      break;
  //  }
}

/* USER CODE END PB_Callbacks */

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
  /* USER CODE BEGIN OnRxData_1 */
  uint8_t RxPort = 0;

  if (params != NULL)
  {

    UTIL_TIMER_Start(&RxLedTimer);

    if (params->IsMcpsIndication)
    {
      if (appData != NULL)
      {
        RxPort = appData->Port;
        if (appData->Buffer != NULL)
        {
          switch (appData->Port)
          {
          case LORAWAN_SWITCH_CLASS_PORT:
            /*this port switches the class*/
            if (appData->BufferSize == 1)
            {
              switch (appData->Buffer[0])
              {
              case 0:
              {
                LmHandlerRequestClass(CLASS_A);
                break;
              }
              case 1:
              {
                LmHandlerRequestClass(CLASS_B);
                break;
              }
              case 2:
              {
                LmHandlerRequestClass(CLASS_C);
                break;
              }
              default:
                break;
              }
            }
            break;
          case LORAWAN_USER_APP_PORT:
            if (appData->BufferSize == 1)
            {
              AppLedStateOn = appData->Buffer[0] & 0x01;
              if (AppLedStateOn == RESET)
              {
                APP_LOG(TS_OFF, VLEVEL_H, "LED OFF\r\n");
              }
              else
              {
                APP_LOG(TS_OFF, VLEVEL_H, "LED ON\r\n");
              }
            }
            break;

          default:

            break;
          }
        }
      }
    }
    if (params->RxSlot < RX_SLOT_NONE)
    {
      APP_LOG(TS_OFF, VLEVEL_H, "###### D/L FRAME:%04d | PORT:%d | DR:%d | SLOT:%s | RSSI:%d | SNR:%d\r\n",
              params->DownlinkCounter, RxPort, params->Datarate, slotStrings[params->RxSlot], params->Rssi, params->Snr);
    }
  }
  /* USER CODE END OnRxData_1 */
}

static void SendTxData(void)
{
  /* USER CODE BEGIN SendTxData_1 */
	UTIL_TIMER_Stop(&JoinLedTimer);

  LmHandlerErrorStatus_t status = LORAMAC_HANDLER_ERROR; // 用于记录是坦戝功坑�??
  uint8_t batteryLevel = GetBatteryLevel();              // VDD
  float temperature = 0;                                 // temp
	float humidity = 0;																		 // hum
  UTIL_TIMER_Time_t nextTxIn = 0;

#ifdef CAYENNE_LPP
  uint8_t channel = 0;
#else
  uint8_t battery = 100; // 默认电池电針�?100
  uint32_t i = 0;
#endif /* CAYENNE_LPP */

  if (!Adafruit_SHT31_begin(&g_sht31, &hi2c2, 0x44)) {
    APP_LOG(TS_ON, VLEVEL_L, "SHT31 init failed\r\n");
  } else {
    APP_LOG(TS_ON, VLEVEL_L, "SHT31 init ok\r\n");
  }

  Adafruit_SHT31_readTemperature(&g_sht31);
  Adafruit_SHT31_readHumidity(&g_sht31);
  temperature = g_sht31.temp;
  humidity = g_sht31.humidity;
	APP_LOG(TS_ON, VLEVEL_L, "VDD is %d\r\n", batteryLevel);
	APP_LOG(TS_ON, VLEVEL_L, "temperature is %d\r\n",g_sht31.temp);
	APP_LOG(TS_ON, VLEVEL_L, "humidity is %d\r\n", g_sht31.humidity);

  AppData.Port = LORAWAN_USER_APP_PORT;

#ifdef CAYENNE_LPP
  CayenneLppReset();
  CayenneLppAddBarometricPressure(channel++, sensor_data.pressure);
  CayenneLppAddTemperature(channel++, sensor_data.temperature);
  CayenneLppAddRelativeHumidity(channel++, (uint16_t)(sensor_data.humidity));

  if ((LmHandlerParams.ActiveRegion != LORAMAC_REGION_US915) && (LmHandlerParams.ActiveRegion != LORAMAC_REGION_AU915) && (LmHandlerParams.ActiveRegion != LORAMAC_REGION_AS923))
  {
    CayenneLppAddDigitalInput(channel++, GetBatteryLevel());
    CayenneLppAddDigitalOutput(channel++, AppLedStateOn);
  }

  CayenneLppCopy(AppData.Buffer);
  AppData.BufferSize = CayenneLppGetSize();
#else  /* not CAYENNE_LPP */
  /* �? float 温度转杢�? centi-degrees 的整数，靿兝�? float 使用佝移擝作导致编译错误 */
  int16_t temp_centi = (int16_t)(temperature * 100.0f); /* e.g. 23.45 -> 2345 */
  uint16_t hum_centi = (uint16_t)(humidity * 100u);     /* 若有真实湿度值请先赋�? humidity */

  /* 4) 填充 AppData.Buffer �? 网关 parseMultiSensor 覝求的顺庝：
   * [0..1] temperature (signed, centi-deg)  -> ((b0<<8)|b1)/100
   * [2..3] humidity    (unsigned, centi-%)  -> ((b2<<8)|b3)/100
   * [4]    battery (0..254)
   * [5]    status
   */
  AppData.Buffer[i++] = (uint8_t)((temp_centi >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(temp_centi & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((hum_centi >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(hum_centi & 0xFF);
  AppData.Buffer[i++] = battery;
  AppData.Buffer[i++] = 0; // status，保留字段，暂填0
  AppData.BufferSize = i;
#endif /* CAYENNE_LPP */


  if ((JoinLedTimer.IsRunning) && (LmHandlerJoinStatus() == LORAMAC_HANDLER_SET))
  {
    UTIL_TIMER_Stop(&JoinLedTimer);
  }

  status = LmHandlerSend(&AppData, LmHandlerParams.IsTxConfirmed, false);
  if (LORAMAC_HANDLER_SUCCESS == status)
  {
    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
  }
  else if (LORAMAC_HANDLER_DUTYCYCLE_RESTRICTED == status)
  {
    nextTxIn = LmHandlerGetDutyCycleWaitTime();
    if (nextTxIn > 0)
    {
      APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
    }
  }

  if (EventType == TX_ON_TIMER)
  {
    UTIL_TIMER_Stop(&TxTimer);
    UTIL_TIMER_SetPeriod(&TxTimer, MAX(nextTxIn, TxPeriodicity));
    UTIL_TIMER_Start(&TxTimer);
  }

  /* USER CODE END SendTxData_1 */
}

static void OnTxTimerEvent(void *context)
{
  /* USER CODE BEGIN OnTxTimerEvent_1 */

